# CwpReuseGridsSameName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpReuseGridsSameName Property
ParameterTypeId Class See Also
---
"Reuse Grids with the same name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpReuseGridsSameName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpReuseGridsSameName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpReuseGridsSameName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace